---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SpaceSet
source: html/ff608354-dee5-99f7-fca3-d8b20ff5733d.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet

A set that can contain any type of object.

## Syntax (C#)
```csharp
public class SpaceSet : APIObject, IEnumerable
```